{
    "startDate": "2017-09-30",
    "endDate": "2017-09-30",
    "year": "2017",
    "quarter": "Q3",
    "symbol": "MLWF",
    "data": {
        "bs": [
            {
                "label": "This element represents the cash available for day-to-day operating needs and carrying amounts of cash and cash equivalent items which are restricted for withdrawal or usage. Restrictions may include legally restricted deposits held as compensating balances against short-term borrowing arrangements, contracts entered into with others, or entity statements of intention with regard to particular deposits; however, time deposits and short-term certificates of deposit are not generally included in legally restricted deposits. Restrictions exclude compensating balance arrangements that are not agreements which legally restrict the use of cash amounts shown on the balance sheet. For a classified balance sheet represents the current portion only (the noncurrent portion has a separate concept); there is a separate and distinct element for unclassified presentations.",
                "concept": "mlwf:CashAndRestrictedCash",
                "unit": "usd",
                "value": 673768947
            },
            {
                "label": "This element represents the net unrealized profits on open futures contracts which arise on an account of translation difference and the impact of market and credit risk.",
                "concept": "mlwf:NetUnrealizedProfitOnOpenFuturesContracts",
                "unit": "usd",
                "value": 17042605
            },
            {
                "label": "This element represents the net unrealized profits on open forwards contracts which arise on an account of translation difference and the impact of market and credit risk.",
                "concept": "mlwf:NetUnrealizedProfitOnOpenForwardsContracts",
                "unit": "usd",
                "value": 1427889
            },
            {
                "label": "Amount of currency on hand as well as demand deposits with banks or financial institutions. Includes other kinds of accounts that have the general characteristics of demand deposits. Also includes short-term, highly liquid investments that are both readily convertible to known amounts of cash and so near their maturity that they present insignificant risk of changes in value because of changes in interest rates. Excludes cash and cash equivalents within disposal groups and discontinued operations and also excludes cash and restricted cash within commodity trading accounts.",
                "concept": "mlwf:CashAndCashEquivalentsAtCarryingValueExcludingCashHeldInCommodityTradingAccounts",
                "unit": "usd",
                "value": 483049
            },
            {
                "label": "Other Assets",
                "concept": "OtherAssets",
                "unit": "usd",
                "value": 520444
            },
            {
                "label": "Assets [Abstract]",
                "concept": "Assets",
                "unit": "usd",
                "value": 693242934
            },
            {
                "label": "Payables to Broker-Dealers and Clearing Organizations",
                "concept": "PayablesToBrokerDealersAndClearingOrganizations",
                "unit": "usd",
                "value": 5870
            },
            {
                "label": "This element represents the outstanding sponsorship fees payable based on the classes of units and fees paid to its trading advisor.",
                "concept": "mlwf:SponsorAndAdvisoryFeesPayable",
                "unit": "usd",
                "value": 1233539
            },
            {
                "label": "This element represents redemption proceeds payable to the various classes of unit holders based on the maturity and redemption pattern.",
                "concept": "mlwf:RedemptionsPayable",
                "unit": "usd",
                "value": 12320104
            },
            {
                "label": "This element represents the net unrealized losses on open futures contracts which arise on an account of translation difference and the impact of market and credit risk.",
                "concept": "mlwf:NetUnrealizedLossOnOpenFuturesContracts",
                "unit": "usd",
                "value": 18718535
            },
            {
                "label": "This element represents the net unrealized losses on open forwards contracts which arise on an account of translation difference and also the impact of market and credit risk.",
                "concept": "mlwf:NetUnrealizedLossOnOpenForwardsContracts",
                "unit": "usd",
                "value": 4071279
            },
            {
                "label": "Other Liabilities",
                "concept": "OtherLiabilities",
                "unit": "usd",
                "value": 475261
            },
            {
                "label": "Liabilities and Equity [Abstract]",
                "concept": "Liabilities",
                "unit": "usd",
                "value": 36824588
            },
            {
                "label": "Members' Capital",
                "concept": "MembersCapital",
                "unit": "usd",
                "value": 656418346
            },
            {
                "label": "Members' Equity [Abstract]",
                "concept": "MembersEquity",
                "unit": "usd",
                "value": 656418346
            },
            {
                "label": "Liabilities and Equity [Abstract]",
                "concept": "LiabilitiesAndStockholdersEquity",
                "unit": "usd",
                "value": 693242934
            }
        ],
        "cf": [],
        "ic": []
    }
}